tool_vof/example/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    ( 0 0 -0.5)
    ( 4 0 -0.5)
    ( 4 4 -0.5)
    ( 0 4 -0.5)
    ( 0 0  0.5)
    ( 4 0  0.5)
    ( 4 4  0.5)
    ( 0 4  0.5)
);

blocks
(
hex (0 1 2 3 4 5 6 7) (200 200 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    left  { type wall; faces ( (0 4 7 3)); }
    right { type wall; faces ( (2 6 5 1)); }
    bottom{ type wall; faces ( (1 5 4 0)); }
    top   { type wall; faces ( (3 7 6 2)); }
    front
    {
        type empty;
        faces
        (
            (0 3 2 1)
        );
    }
    back
    {
        type empty;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
